<template>
  <el-tooltip placement="left"
              width="420"
              trigger="click"
  >
    <div slot="content" class="lh-base">
      价格=(运费+产品成本价*折扣比例+包材费) / (1-平台费率-平台退款率-平台公摊率-蝌蚪提价率-利润率) X 汇率/(1-20%店铺折扣)
      <br>利润率=1-平台费率-平台退款率-平台公摊率-蝌蚪提价率-(运费+产品成本价*折扣比例+包材费)/{价格*(1-20%店铺折扣)/汇率}
      <br>利润额=价格*利润率
      <br><br>通过利润额算价格：
      <br>价格=利润额+(运费+产品成本价*折扣比例+包材费) / (1-平台费率-平台退款率-平台公摊率-蝌蚪提价率) X 汇率/(1-20%店铺折扣)
      <br>通过利润额算利润率：
      <br>利润率=利润额/{利润额+(运费+产品成本价*折扣比例+包材费) / (1-平台费率-平台退款率-平台公摊率-蝌蚪提价率) X 汇率/(1-20%店铺折扣)}
      <br><br>运费获取：
      <br>发货仓为本地仓或者虚拟海外仓的运费=物流接口返回的运费；
      <br>发货仓为海外仓的运费=头程运费+尾程运费（即物流接口返回的运费）
      <br>海外仓快递及空运头程运费=快递及空运头程37元/kg*重量+1美元仓租*汇率
      <br>海外仓海运头程运费 =15元/KG*重量+1美元仓租*汇率
    </div>
    <el-button type="primary" size="mini">查看价格式</el-button>
  </el-tooltip>
</template>

<script>
export default {

}
</script>

<style>

</style>
